# Part 4

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats
import warnings
warnings.filterwarnings('ignore')

### Question
The stakeholder's first question is: does the MPAA rating of a movie (G/PG/PG-13/R) affect how much revenue the movie generates?

In [2]:
# imports
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from urllib.parse import quote_plus as urlquote
# Create connection string using credentials following this format

In [3]:
tmdb = pd.read_csv("tmdb_api.csv")
tmdb.head()

    Movie_ID      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0113026  10000000.0         0.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694    150000.0  12854953.0            PG

In [4]:
import json
with open('/Users/miran/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [5]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/tmdb"

In [6]:
# create sqlite engine for a database called schools
engine = create_engine(connection)
# create connection to engine
conn = engine.connect()

In [7]:
database_exists(connection)

True

In [8]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [9]:
tmdb.to_sql('tmdb', engine, if_exists = 'replace')

2569

In [10]:
q = """SELECT * FROM tmdb;"""
pd.read_sql(q, engine)

      index   Movie_ID      budget     revenue certification
0         0          0         NaN         NaN          None
1         1  tt0113026  10000000.0         0.0          None
2         2  tt0113092         0.0         0.0          None
3         3  tt0116391         0.0         0.0          None
4         4  tt0118694    150000.0  12854953.0            PG
...     ...        ...         ...         ...           ...
2564   2564  tt7797670         0.0         0.0          None
2565   2565  tt7797790         0.0         0.0          None
2566   2566  tt8665056         0.0         0.0          None
2567   2567  tt8795764         0.0         0.0            NR
2568   2568  tt9071078         0.0         0.0          None

[2569 rows x 5 columns]

In [11]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

  Tables_in_tmdb
0           tmdb